In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
my_data = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
ser = pd.Series(index = labels,data = my_data)

In [4]:
print(ser)

a    10
b    20
c    30
dtype: int32

In [5]:
ser2 = pd.Series(d)
ser2

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(data = [print,sum,len])

0    <built-in function print>
1      <built-in function sum>
2      <built-in function len>
dtype: object

In [7]:
ser1 = pd.Series([1,2,3,4],['Chinchawad','Gandhinagar','Valivade','Kolhapur'])
ser2 = pd.Series([1,2,5,4],['Chinchawad','Gandhinagar','Mudshingi','Kolhapur'])

In [8]:
ser1

Chinchawad     1
Gandhinagar    2
Valivade       3
Kolhapur       4
dtype: int64

In [9]:
ser2

Chinchawad     1
Gandhinagar    2
Mudshingi      5
Kolhapur       4
dtype: int64

In [10]:
print(ser1['Valivade'])

3

In [11]:
ser1 + ser2

Chinchawad     2.0
Gandhinagar    4.0
Kolhapur       8.0
Mudshingi      NaN
Valivade       NaN
dtype: float64

In [12]:
# DataFrame
np.random.seed(101)

In [13]:
df = pd.DataFrame(data = np.random.randn(5,4),index = 'A B C D E'.split(),columns ="W X Y Z".split())

In [14]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df[['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [16]:
df['New'] = df['X'] +df['Y']

In [17]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [18]:
df.drop('New',axis=1,inplace=True)

In [19]:
df.iloc[[1,4]]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
E  0.190794  1.978757  2.605967  0.683509

In [20]:
# conditional statements

In [21]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
newind = 'CN KS TS RE TU'.split()

In [23]:
df['states'] = newind

In [24]:
df.set_index('states')

               W         X         Y         Z
states
CN      2.706850  0.628133  0.907969  0.503826
KS      0.651118 -0.319318 -0.848077  0.605965
TS     -2.018168  0.740122  0.528813 -0.589001
RE      0.188695 -0.758872 -0.933237  0.955057
TU      0.190794  1.978757  2.605967  0.683509

In [25]:
# higher index and more about indexing

In [26]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [27]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [28]:
df1 = pd.DataFrame(np.random.randn(6,3),index=hier_index,columns=['A',"B",'C'])

In [29]:
df1

             A         B         C
G1 1  0.302665  1.693723 -1.706086
   2 -1.159119 -0.134841  0.390528
   3  0.166905  0.184502  0.807706
G2 1  0.072960  0.638787  0.329646
   2 -0.497104 -0.754070 -0.943406
   3  0.484752 -0.116773  1.901755

In [30]:
df1.loc['G1'].loc[[1,3]]

          A         B         C
1  0.302665  1.693723 -1.706086
3  0.166905  0.184502  0.807706

In [31]:
df1.index.names = ['Group','Num']

In [32]:
df1.xs('G2',level='Group')

            A         B         C
Num
1    0.072960  0.638787  0.329646
2   -0.497104 -0.754070 -0.943406
3    0.484752 -0.116773  1.901755

In [33]:
df.drop('states',axis=1,inplace=True)

In [34]:
df = df[df>0]

In [35]:
a = {'A':[1,2,np.nan],'B':[4,np.nan,np.nan],'C':[6,8,7]}
df1 = pd.DataFrame(a)
df1

     A    B  C
0  1.0  4.0  6
1  2.0  NaN  8
2  NaN  NaN  7

In [36]:
df1.dropna(axis=1,thresh=2)

     A  C
0  1.0  6
1  2.0  8
2  NaN  7

In [37]:
df1.fillna(value = "Sourabh")

         A        B  C
0      1.0      4.0  6
1      2.0  Sourabh  8
2  Sourabh  Sourabh  7

In [38]:
df1.fillna(value=df1['C'].mean())

     A    B  C
0  1.0  4.0  6
1  2.0  7.0  8
2  7.0  7.0  7

In [39]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [40]:
df2 = pd.DataFrame(data)
df2

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [41]:
df2.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [42]:
dframe1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [43]:
dframe2= pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [44]:
dframe3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [45]:
dframe3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [46]:
pd.concat([dframe1,dframe2],axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [47]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [48]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [49]:
pd.merge(left,right,on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [50]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [54]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [55]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [56]:
# Joins

In [57]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [58]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [69]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [73]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [82]:
df['col1'].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [83]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [84]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [87]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False